Revit 2027 API
IFCLegacyStairOrRamp.GetRunGeometries Method
 Gets the geometries of runs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IList<GeometryObject>> GetRunGeometries()
Public Function GetRunGeometries As IList(Of IList(Of GeometryObject))
public:
IList<IList<GeometryObject^>^>^ GetRunGeometries()
member GetRunGeometries : unit -> IList<IList<GeometryObject>>
Return Value
IList<IList<GeometryObject>>
 The geometries of runs.
See Also
Reference
IFCLegacyStairOrRamp Class
Autodesk.Revit.DB.IFC Namespace